###############################################################
#  Generated by:      Cadence Encounter 09.11-s084_1
#  OS:                Linux x86_64(Host ID 5013-w19)
#  Generated on:      Tue Mar 21 15:02:31 2017
#  Command:           saveDesign sorter_top_final.enc
###############################################################
set sdc_version 1.4
current_design sorter_top
create_clock [get_ports {padClk}]  -name padClk -period 7 -waveform {0 3.5}
set_propagated_clock  [get_ports {padClk}]
