###############################################################
#  Generated by:      Cadence Encounter 09.11-s084_1
#  OS:                Linux x86_64(Host ID 5013-w19)
#  Generated on:      Tue Mar 21 15:05:24 2017
#  Command:           saveDesign sorter_top.enc
###############################################################
set sdc_version 1.4
current_design sorter_top
create_clock [get_ports {padClk}]  -name padClk -period 8 -waveform {0 4}
set_propagated_clock  [get_ports {padClk}]
