###############################################################
#  Generated by:      Cadence Encounter 09.11-s084_1
#  OS:                Linux x86_64(Host ID 5013-w39)
#  Generated on:      Fri Mar 31 19:06:22 2017
#  Command:           saveDesign sorter_top.enc
###############################################################
set sdc_version 1.4
current_design sorter_top
create_clock [get_ports {padClk}]  -name padClk -period 4 -waveform {0 2}
set_propagated_clock  [get_ports {padClk}]
